{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "F_m1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "F_m1/bias", "shape": [64], "dtype": "float32"}, {"name": "F_0/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "F_0/bias", "shape": [64], "dtype": "float32"}, {"name": "F_1_1/kernel", "shape": [3, 3, 64, 4], "dtype": "float32"}, {"name": "F_1_1/bias", "shape": [4], "dtype": "float32"}, {"name": "LFF_1/kernel", "shape": [1, 1, 68, 64], "dtype": "float32"}, {"name": "LFF_1/bias", "shape": [64], "dtype": "float32"}, {"name": "F_2_1/kernel", "shape": [3, 3, 64, 4], "dtype": "float32"}, {"name": "F_2_1/bias", "shape": [4], "dtype": "float32"}, {"name": "LFF_2/kernel", "shape": [1, 1, 68, 64], "dtype": "float32"}, {"name": "LFF_2/bias", "shape": [64], "dtype": "float32"}, {"name": "GFF_1/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "GFF_1/bias", "shape": [64], "dtype": "float32"}, {"name": "GFF_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "GFF_2/bias", "shape": [64], "dtype": "float32"}, {"name": "UPN1/kernel", "shape": [5, 5, 64, 64], "dtype": "float32"}, {"name": "UPN1/bias", "shape": [64], "dtype": "float32"}, {"name": "UPN2/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "UPN2/bias", "shape": [32], "dtype": "float32"}, {"name": "UPN3/kernel", "shape": [3, 3, 32, 192], "dtype": "float32"}, {"name": "UPN3/bias", "shape": [192], "dtype": "float32"}, {"name": "SR/kernel", "shape": [3, 3, 192, 3], "dtype": "float32"}, {"name": "SR/bias", "shape": [3], "dtype": "float32"}]}]}