{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "F_m1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "F_m1/bias", "shape": [64], "dtype": "float32"}, {"name": "F_0/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "F_0/bias", "shape": [64], "dtype": "float32"}, {"name": "F_1_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "F_1_1/bias", "shape": [64], "dtype": "float32"}, {"name": "LFF_1/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "LFF_1/bias", "shape": [64], "dtype": "float32"}, {"name": "F_2_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "F_2_1/bias", "shape": [64], "dtype": "float32"}, {"name": "LFF_2/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "LFF_2/bias", "shape": [64], "dtype": "float32"}, {"name": "F_3_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "F_3_1/bias", "shape": [64], "dtype": "float32"}, {"name": "LFF_3/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "LFF_3/bias", "shape": [64], "dtype": "float32"}, {"name": "F_4_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "F_4_1/bias", "shape": [64], "dtype": "float32"}, {"name": "LFF_4/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "LFF_4/bias", "shape": [64], "dtype": "float32"}, {"name": "F_5_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "F_5_1/bias", "shape": [64], "dtype": "float32"}, {"name": "LFF_5/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "LFF_5/bias", "shape": [64], "dtype": "float32"}, {"name": "F_6_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "F_6_1/bias", "shape": [64], "dtype": "float32"}, {"name": "LFF_6/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "LFF_6/bias", "shape": [64], "dtype": "float32"}, {"name": "F_7_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "F_7_1/bias", "shape": [64], "dtype": "float32"}, {"name": "LFF_7/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "LFF_7/bias", "shape": [64], "dtype": "float32"}, {"name": "F_8_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "F_8_1/bias", "shape": [64], "dtype": "float32"}, {"name": "LFF_8/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "LFF_8/bias", "shape": [64], "dtype": "float32"}, {"name": "F_9_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "F_9_1/bias", "shape": [64], "dtype": "float32"}, {"name": "LFF_9/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "LFF_9/bias", "shape": [64], "dtype": "float32"}, {"name": "F_10_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "F_10_1/bias", "shape": [64], "dtype": "float32"}, {"name": "LFF_10/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "LFF_10/bias", "shape": [64], "dtype": "float32"}, {"name": "GFF_1/kernel", "shape": [1, 1, 640, 64], "dtype": "float32"}, {"name": "GFF_1/bias", "shape": [64], "dtype": "float32"}, {"name": "GFF_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "GFF_2/bias", "shape": [64], "dtype": "float32"}, {"name": "UPN1/kernel", "shape": [5, 5, 64, 64], "dtype": "float32"}, {"name": "UPN1/bias", "shape": [64], "dtype": "float32"}, {"name": "UPN2/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "UPN2/bias", "shape": [32], "dtype": "float32"}, {"name": "UPN3/kernel", "shape": [3, 3, 32, 12], "dtype": "float32"}, {"name": "UPN3/bias", "shape": [12], "dtype": "float32"}, {"name": "SR/kernel", "shape": [3, 3, 12, 3], "dtype": "float32"}, {"name": "SR/bias", "shape": [3], "dtype": "float32"}]}]}