{"format": "layers-model", "generatedBy": "keras v2.10.0", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"keras_version": "2.10.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "generator", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "LR"}, "name": "LR", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "F_m1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_m1", "inbound_nodes": [[["LR", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_0", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_0", "inbound_nodes": [[["F_m1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_1_1", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_1_1", "inbound_nodes": [[["F_0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_1_1_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_1_1_Relu", "inbound_nodes": [[["F_1_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_1_1", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_1_1", "inbound_nodes": [[["F_0", 0, 0, {}], ["F_1_1_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LFF_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LFF_1", "inbound_nodes": [[["RDB_Concat_1_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "LRL_1", "trainable": true, "dtype": "float32"}, "name": "LRL_1", "inbound_nodes": [[["LFF_1", 0, 0, {}], ["F_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_2_1", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_2_1", "inbound_nodes": [[["LRL_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_2_1_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_2_1_Relu", "inbound_nodes": [[["F_2_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_2_1", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_2_1", "inbound_nodes": [[["LRL_1", 0, 0, {}], ["F_2_1_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LFF_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LFF_2", "inbound_nodes": [[["RDB_Concat_2_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "LRL_2", "trainable": true, "dtype": "float32"}, "name": "LRL_2", "inbound_nodes": [[["LFF_2", 0, 0, {}], ["LRL_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "LRLs_Concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "LRLs_Concat", "inbound_nodes": [[["LRL_1", 0, 0, {}], ["LRL_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "GFF_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "GFF_1", "inbound_nodes": [[["LRLs_Concat", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "GFF_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "GFF_2", "inbound_nodes": [[["GFF_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "FDF", "trainable": true, "dtype": "float32"}, "name": "FDF", "inbound_nodes": [[["GFF_2", 0, 0, {}], ["F_m1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "UPN1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "UPN1", "inbound_nodes": [[["FDF", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "UPN1_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "UPN1_Relu", "inbound_nodes": [[["UPN1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "UPN2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "UPN2", "inbound_nodes": [[["UPN1_Relu", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "UPN2_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "UPN2_Relu", "inbound_nodes": [[["UPN2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "UPN3", "trainable": true, "dtype": "float32", "filters": 12, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "UPN3", "inbound_nodes": [[["UPN2_Relu", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "UPsample", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "UPsample", "inbound_nodes": [[["UPN3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "SR", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "SR", "inbound_nodes": [[["UPsample", 0, 0, {}]]]}], "input_layers": [["LR", 0, 0]], "output_layers": [["SR", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "F_0/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "F_0/bias", "shape": [64], "dtype": "float32"}, {"name": "F_1_1/kernel", "shape": [3, 3, 64, 4], "dtype": "float32"}, {"name": "F_1_1/bias", "shape": [4], "dtype": "float32"}, {"name": "F_2_1/kernel", "shape": [3, 3, 64, 4], "dtype": "float32"}, {"name": "F_2_1/bias", "shape": [4], "dtype": "float32"}, {"name": "F_m1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "F_m1/bias", "shape": [64], "dtype": "float32"}, {"name": "GFF_1/kernel", "shape": [1, 1, 128, 64], "dtype": "float32"}, {"name": "GFF_1/bias", "shape": [64], "dtype": "float32"}, {"name": "GFF_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "GFF_2/bias", "shape": [64], "dtype": "float32"}, {"name": "LFF_1/kernel", "shape": [1, 1, 68, 64], "dtype": "float32"}, {"name": "LFF_1/bias", "shape": [64], "dtype": "float32"}, {"name": "LFF_2/kernel", "shape": [1, 1, 68, 64], "dtype": "float32"}, {"name": "LFF_2/bias", "shape": [64], "dtype": "float32"}, {"name": "SR/kernel", "shape": [3, 3, 12, 3], "dtype": "float32"}, {"name": "SR/bias", "shape": [3], "dtype": "float32"}, {"name": "UPN1/kernel", "shape": [5, 5, 64, 64], "dtype": "float32"}, {"name": "UPN1/bias", "shape": [64], "dtype": "float32"}, {"name": "UPN2/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "UPN2/bias", "shape": [32], "dtype": "float32"}, {"name": "UPN3/kernel", "shape": [3, 3, 32, 12], "dtype": "float32"}, {"name": "UPN3/bias", "shape": [12], "dtype": "float32"}]}]}