{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "generator", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "LR"}, "name": "LR", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "F_m1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_m1", "inbound_nodes": [[["LR", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_0", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_0", "inbound_nodes": [[["F_m1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_1_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_1_1", "inbound_nodes": [[["F_0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_1_1_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_1_1_Relu", "inbound_nodes": [[["F_1_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_1_1", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_1_1", "inbound_nodes": [[["F_0", 0, 0, {}], ["F_1_1_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_1_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_1_2", "inbound_nodes": [[["RDB_Concat_1_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_1_2_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_1_2_Relu", "inbound_nodes": [[["F_1_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_1_2", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_1_2", "inbound_nodes": [[["RDB_Concat_1_1", 0, 0, {}], ["F_1_2_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_1_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_1_3", "inbound_nodes": [[["RDB_Concat_1_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_1_3_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_1_3_Relu", "inbound_nodes": [[["F_1_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_1_3", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_1_3", "inbound_nodes": [[["RDB_Concat_1_2", 0, 0, {}], ["F_1_3_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LFF_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LFF_1", "inbound_nodes": [[["RDB_Concat_1_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "LRL_1", "trainable": true, "dtype": "float32"}, "name": "LRL_1", "inbound_nodes": [[["LFF_1", 0, 0, {}], ["F_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_2_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_2_1", "inbound_nodes": [[["LRL_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_2_1_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_2_1_Relu", "inbound_nodes": [[["F_2_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_2_1", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_2_1", "inbound_nodes": [[["LRL_1", 0, 0, {}], ["F_2_1_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_2_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_2_2", "inbound_nodes": [[["RDB_Concat_2_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_2_2_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_2_2_Relu", "inbound_nodes": [[["F_2_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_2_2", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_2_2", "inbound_nodes": [[["RDB_Concat_2_1", 0, 0, {}], ["F_2_2_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_2_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_2_3", "inbound_nodes": [[["RDB_Concat_2_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_2_3_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_2_3_Relu", "inbound_nodes": [[["F_2_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_2_3", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_2_3", "inbound_nodes": [[["RDB_Concat_2_2", 0, 0, {}], ["F_2_3_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LFF_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LFF_2", "inbound_nodes": [[["RDB_Concat_2_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "LRL_2", "trainable": true, "dtype": "float32"}, "name": "LRL_2", "inbound_nodes": [[["LFF_2", 0, 0, {}], ["LRL_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_3_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_3_1", "inbound_nodes": [[["LRL_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_3_1_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_3_1_Relu", "inbound_nodes": [[["F_3_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_3_1", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_3_1", "inbound_nodes": [[["LRL_2", 0, 0, {}], ["F_3_1_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_3_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_3_2", "inbound_nodes": [[["RDB_Concat_3_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_3_2_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_3_2_Relu", "inbound_nodes": [[["F_3_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_3_2", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_3_2", "inbound_nodes": [[["RDB_Concat_3_1", 0, 0, {}], ["F_3_2_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_3_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_3_3", "inbound_nodes": [[["RDB_Concat_3_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_3_3_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_3_3_Relu", "inbound_nodes": [[["F_3_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_3_3", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_3_3", "inbound_nodes": [[["RDB_Concat_3_2", 0, 0, {}], ["F_3_3_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LFF_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LFF_3", "inbound_nodes": [[["RDB_Concat_3_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "LRL_3", "trainable": true, "dtype": "float32"}, "name": "LRL_3", "inbound_nodes": [[["LFF_3", 0, 0, {}], ["LRL_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_4_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_4_1", "inbound_nodes": [[["LRL_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_4_1_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_4_1_Relu", "inbound_nodes": [[["F_4_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_4_1", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_4_1", "inbound_nodes": [[["LRL_3", 0, 0, {}], ["F_4_1_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_4_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_4_2", "inbound_nodes": [[["RDB_Concat_4_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_4_2_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_4_2_Relu", "inbound_nodes": [[["F_4_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_4_2", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_4_2", "inbound_nodes": [[["RDB_Concat_4_1", 0, 0, {}], ["F_4_2_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_4_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_4_3", "inbound_nodes": [[["RDB_Concat_4_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_4_3_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_4_3_Relu", "inbound_nodes": [[["F_4_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_4_3", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_4_3", "inbound_nodes": [[["RDB_Concat_4_2", 0, 0, {}], ["F_4_3_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LFF_4", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LFF_4", "inbound_nodes": [[["RDB_Concat_4_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "LRL_4", "trainable": true, "dtype": "float32"}, "name": "LRL_4", "inbound_nodes": [[["LFF_4", 0, 0, {}], ["LRL_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_5_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_5_1", "inbound_nodes": [[["LRL_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_5_1_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_5_1_Relu", "inbound_nodes": [[["F_5_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_5_1", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_5_1", "inbound_nodes": [[["LRL_4", 0, 0, {}], ["F_5_1_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_5_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_5_2", "inbound_nodes": [[["RDB_Concat_5_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_5_2_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_5_2_Relu", "inbound_nodes": [[["F_5_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_5_2", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_5_2", "inbound_nodes": [[["RDB_Concat_5_1", 0, 0, {}], ["F_5_2_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_5_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_5_3", "inbound_nodes": [[["RDB_Concat_5_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_5_3_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_5_3_Relu", "inbound_nodes": [[["F_5_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_5_3", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_5_3", "inbound_nodes": [[["RDB_Concat_5_2", 0, 0, {}], ["F_5_3_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LFF_5", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LFF_5", "inbound_nodes": [[["RDB_Concat_5_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "LRL_5", "trainable": true, "dtype": "float32"}, "name": "LRL_5", "inbound_nodes": [[["LFF_5", 0, 0, {}], ["LRL_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_6_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_6_1", "inbound_nodes": [[["LRL_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_6_1_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_6_1_Relu", "inbound_nodes": [[["F_6_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_6_1", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_6_1", "inbound_nodes": [[["LRL_5", 0, 0, {}], ["F_6_1_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_6_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_6_2", "inbound_nodes": [[["RDB_Concat_6_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_6_2_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_6_2_Relu", "inbound_nodes": [[["F_6_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_6_2", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_6_2", "inbound_nodes": [[["RDB_Concat_6_1", 0, 0, {}], ["F_6_2_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_6_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_6_3", "inbound_nodes": [[["RDB_Concat_6_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_6_3_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_6_3_Relu", "inbound_nodes": [[["F_6_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_6_3", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_6_3", "inbound_nodes": [[["RDB_Concat_6_2", 0, 0, {}], ["F_6_3_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LFF_6", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LFF_6", "inbound_nodes": [[["RDB_Concat_6_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "LRL_6", "trainable": true, "dtype": "float32"}, "name": "LRL_6", "inbound_nodes": [[["LFF_6", 0, 0, {}], ["LRL_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_7_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_7_1", "inbound_nodes": [[["LRL_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_7_1_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_7_1_Relu", "inbound_nodes": [[["F_7_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_7_1", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_7_1", "inbound_nodes": [[["LRL_6", 0, 0, {}], ["F_7_1_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_7_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_7_2", "inbound_nodes": [[["RDB_Concat_7_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_7_2_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_7_2_Relu", "inbound_nodes": [[["F_7_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_7_2", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_7_2", "inbound_nodes": [[["RDB_Concat_7_1", 0, 0, {}], ["F_7_2_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_7_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_7_3", "inbound_nodes": [[["RDB_Concat_7_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_7_3_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_7_3_Relu", "inbound_nodes": [[["F_7_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_7_3", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_7_3", "inbound_nodes": [[["RDB_Concat_7_2", 0, 0, {}], ["F_7_3_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LFF_7", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LFF_7", "inbound_nodes": [[["RDB_Concat_7_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "LRL_7", "trainable": true, "dtype": "float32"}, "name": "LRL_7", "inbound_nodes": [[["LFF_7", 0, 0, {}], ["LRL_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_8_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_8_1", "inbound_nodes": [[["LRL_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_8_1_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_8_1_Relu", "inbound_nodes": [[["F_8_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_8_1", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_8_1", "inbound_nodes": [[["LRL_7", 0, 0, {}], ["F_8_1_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_8_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_8_2", "inbound_nodes": [[["RDB_Concat_8_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_8_2_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_8_2_Relu", "inbound_nodes": [[["F_8_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_8_2", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_8_2", "inbound_nodes": [[["RDB_Concat_8_1", 0, 0, {}], ["F_8_2_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_8_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_8_3", "inbound_nodes": [[["RDB_Concat_8_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_8_3_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_8_3_Relu", "inbound_nodes": [[["F_8_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_8_3", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_8_3", "inbound_nodes": [[["RDB_Concat_8_2", 0, 0, {}], ["F_8_3_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LFF_8", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LFF_8", "inbound_nodes": [[["RDB_Concat_8_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "LRL_8", "trainable": true, "dtype": "float32"}, "name": "LRL_8", "inbound_nodes": [[["LFF_8", 0, 0, {}], ["LRL_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_9_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_9_1", "inbound_nodes": [[["LRL_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_9_1_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_9_1_Relu", "inbound_nodes": [[["F_9_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_9_1", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_9_1", "inbound_nodes": [[["LRL_8", 0, 0, {}], ["F_9_1_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_9_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_9_2", "inbound_nodes": [[["RDB_Concat_9_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_9_2_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_9_2_Relu", "inbound_nodes": [[["F_9_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_9_2", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_9_2", "inbound_nodes": [[["RDB_Concat_9_1", 0, 0, {}], ["F_9_2_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_9_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_9_3", "inbound_nodes": [[["RDB_Concat_9_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_9_3_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_9_3_Relu", "inbound_nodes": [[["F_9_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_9_3", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_9_3", "inbound_nodes": [[["RDB_Concat_9_2", 0, 0, {}], ["F_9_3_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LFF_9", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LFF_9", "inbound_nodes": [[["RDB_Concat_9_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "LRL_9", "trainable": true, "dtype": "float32"}, "name": "LRL_9", "inbound_nodes": [[["LFF_9", 0, 0, {}], ["LRL_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_10_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_10_1", "inbound_nodes": [[["LRL_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_10_1_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_10_1_Relu", "inbound_nodes": [[["F_10_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_10_1", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_10_1", "inbound_nodes": [[["LRL_9", 0, 0, {}], ["F_10_1_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_10_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_10_2", "inbound_nodes": [[["RDB_Concat_10_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_10_2_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_10_2_Relu", "inbound_nodes": [[["F_10_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_10_2", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_10_2", "inbound_nodes": [[["RDB_Concat_10_1", 0, 0, {}], ["F_10_2_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "F_10_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "F_10_3", "inbound_nodes": [[["RDB_Concat_10_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "F_10_3_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "F_10_3_Relu", "inbound_nodes": [[["F_10_3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "RDB_Concat_10_3", "trainable": true, "dtype": "float32", "axis": 3}, "name": "RDB_Concat_10_3", "inbound_nodes": [[["RDB_Concat_10_2", 0, 0, {}], ["F_10_3_Relu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "LFF_10", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "LFF_10", "inbound_nodes": [[["RDB_Concat_10_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "LRL_10", "trainable": true, "dtype": "float32"}, "name": "LRL_10", "inbound_nodes": [[["LFF_10", 0, 0, {}], ["LRL_9", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "LRLs_Concat", "trainable": true, "dtype": "float32", "axis": 3}, "name": "LRLs_Concat", "inbound_nodes": [[["LRL_1", 0, 0, {}], ["LRL_2", 0, 0, {}], ["LRL_3", 0, 0, {}], ["LRL_4", 0, 0, {}], ["LRL_5", 0, 0, {}], ["LRL_6", 0, 0, {}], ["LRL_7", 0, 0, {}], ["LRL_8", 0, 0, {}], ["LRL_9", 0, 0, {}], ["LRL_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "GFF_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "GFF_1", "inbound_nodes": [[["LRLs_Concat", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "GFF_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "GFF_2", "inbound_nodes": [[["GFF_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "FDF", "trainable": true, "dtype": "float32"}, "name": "FDF", "inbound_nodes": [[["GFF_2", 0, 0, {}], ["F_m1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "UPN1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "UPN1", "inbound_nodes": [[["FDF", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "UPN1_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "UPN1_Relu", "inbound_nodes": [[["UPN1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "UPN2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "UPN2", "inbound_nodes": [[["UPN1_Relu", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "UPN2_Relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "UPN2_Relu", "inbound_nodes": [[["UPN2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "UPN3", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "UPN3", "inbound_nodes": [[["UPN2_Relu", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "UPsample", "trainable": true, "dtype": "float32", "size": [4, 4], "data_format": "channels_last", "interpolation": "nearest"}, "name": "UPsample", "inbound_nodes": [[["UPN3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "SR", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "SR", "inbound_nodes": [[["UPsample", 0, 0, {}]]]}], "input_layers": [["LR", 0, 0]], "output_layers": [["SR", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "F_0/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13392056174138015, "scale": 0.001164526623838088, "original_dtype": "float32"}}, {"name": "F_0/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.034806769012528306, "scale": 0.00025782791861132077, "original_dtype": "float32"}}, {"name": "F_10_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18768804575882705, "scale": 0.001551140874039893, "original_dtype": "float32"}}, {"name": "F_10_1/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08666732907295227, "scale": 0.00033902103462548673, "original_dtype": "float32"}}, {"name": "F_10_2/kernel", "shape": [3, 3, 128, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3156556021349103, "scale": 0.0019365374364104925, "original_dtype": "float32"}}, {"name": "F_10_2/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0672525073967728, "scale": 0.00042032817122983, "original_dtype": "float32"}}, {"name": "F_10_3/kernel", "shape": [3, 3, 192, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.27818775761361214, "scale": 0.001987055411525801, "original_dtype": "float32"}}, {"name": "F_10_3/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06065498584625768, "scale": 0.0004183102472155702, "original_dtype": "float32"}}, {"name": "F_1_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.21810862316804772, "scale": 0.001717390733606675, "original_dtype": "float32"}}, {"name": "F_1_1/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07260373293184766, "scale": 0.0004776561377095241, "original_dtype": "float32"}}, {"name": "F_1_2/kernel", "shape": [3, 3, 128, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.21736511395258062, "scale": 0.001659275679027333, "original_dtype": "float32"}}, {"name": "F_1_2/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06551855934016845, "scale": 0.0003701613522043415, "original_dtype": "float32"}}, {"name": "F_1_3/kernel", "shape": [3, 3, 192, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.22094485923355703, "scale": 0.001699575840258131, "original_dtype": "float32"}}, {"name": "F_1_3/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0540602042248436, "scale": 0.0003946000308382745, "original_dtype": "float32"}}, {"name": "F_2_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1804665584190219, 