{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v2.0.1.post1",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "generator",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                null,
                null,
                3
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "LR_input"
            },
            "name": "LR_input",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "Pre_blocks_conv",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "Pre_blocks_conv",
            "inbound_nodes": [
              [
                [
                  "LR_input",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_1_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_1_1",
            "inbound_nodes": [
              [
                [
                  "Pre_blocks_conv",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_1_1_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_1_1_Relu",
            "inbound_nodes": [
              [
                [
                  "F_1_1_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_1_1",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_1_1",
            "inbound_nodes": [
              [
                [
                  "Pre_blocks_conv",
                  0,
                  0,
                  {}
                ],
                [
                  "F_1_1_1_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_1_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_1_2",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_1_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_1_2_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_1_2_Relu",
            "inbound_nodes": [
              [
                [
                  "F_1_1_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_1_2",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_1_2",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_1_1",
                  0,
                  0,
                  {}
                ],
                [
                  "F_1_1_2_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_1_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_1_3",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_1_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_1_3_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_1_3_Relu",
            "inbound_nodes": [
              [
                [
                  "F_1_1_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_1_3",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_1_3",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_1_2",
                  0,
                  0,
                  {}
                ],
                [
                  "F_1_1_3_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_1_4",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_1_4",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_1_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_1_4_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_1_4_Relu",
            "inbound_nodes": [
              [
                [
                  "F_1_1_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_1_4",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_1_4",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_1_3",
                  0,
                  0,
                  {}
                ],
                [
                  "F_1_1_4_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "LFF_1_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "LFF_1_1",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_1_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MultiplyBeta",
            "config": {
              "name": "multiply_beta_401",
              "trainable": true,
              "dtype": "float32",
              "beta": 0.2
            },
            "name": "multiply_beta_401",
            "inbound_nodes": [
              [
                [
                  "LFF_1_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "LRL_1_1",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "LRL_1_1",
            "inbound_nodes": [
              [
                [
                  "Pre_blocks_conv",
                  0,
                  0,
                  {}
                ],
                [
                  "multiply_beta_401",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_2_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_2_1",
            "inbound_nodes": [
              [
                [
                  "LRL_1_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_2_1_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_2_1_Relu",
            "inbound_nodes": [
              [
                [
                  "F_1_2_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_2_1",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_2_1",
            "inbound_nodes": [
              [
                [
                  "LRL_1_1",
                  0,
                  0,
                  {}
                ],
                [
                  "F_1_2_1_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_2_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_2_2",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_2_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_2_2_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_2_2_Relu",
            "inbound_nodes": [
              [
                [
                  "F_1_2_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_2_2",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_2_2",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_2_1",
                  0,
                  0,
                  {}
                ],
                [
                  "F_1_2_2_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_2_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_2_3",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_2_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_2_3_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_2_3_Relu",
            "inbound_nodes": [
              [
                [
                  "F_1_2_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_2_3",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_2_3",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_2_2",
                  0,
                  0,
                  {}
                ],
                [
                  "F_1_2_3_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_2_4",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_2_4",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_2_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_2_4_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_2_4_Relu",
            "inbound_nodes": [
              [
                [
                  "F_1_2_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_2_4",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_2_4",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_2_3",
                  0,
                  0,
                  {}
                ],
                [
                  "F_1_2_4_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "LFF_1_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "LFF_1_2",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_2_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MultiplyBeta",
            "config": {
              "name": "multiply_beta_402",
              "trainable": true,
              "dtype": "float32",
              "beta": 0.2
            },
            "name": "multiply_beta_402",
            "inbound_nodes": [
              [
                [
                  "LFF_1_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "LRL_1_2",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "LRL_1_2",
            "inbound_nodes": [
              [
                [
                  "LRL_1_1",
                  0,
                  0,
                  {}
                ],
                [
                  "multiply_beta_402",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_3_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_3_1",
            "inbound_nodes": [
              [
                [
                  "LRL_1_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_3_1_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_3_1_Relu",
            "inbound_nodes": [
              [
                [
                  "F_1_3_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_3_1",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_3_1",
            "inbound_nodes": [
              [
                [
                  "LRL_1_2",
                  0,
                  0,
                  {}
                ],
                [
                  "F_1_3_1_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_3_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_3_2",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_3_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_3_2_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_3_2_Relu",
            "inbound_nodes": [
              [
                [
                  "F_1_3_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_3_2",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_3_2",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_3_1",
                  0,
                  0,
                  {}
                ],
                [
                  "F_1_3_2_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_3_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_3_3",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_3_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_3_3_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_3_3_Relu",
            "inbound_nodes": [
              [
                [
                  "F_1_3_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_3_3",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_3_3",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_3_2",
                  0,
                  0,
                  {}
                ],
                [
                  "F_1_3_3_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_3_4",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_3_4",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_3_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_3_4_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_3_4_Relu",
            "inbound_nodes": [
              [
                [
                  "F_1_3_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_3_4",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_3_4",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_3_3",
                  0,
                  0,
                  {}
                ],
                [
                  "F_1_3_4_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "LFF_1_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "LFF_1_3",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_1_3_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MultiplyBeta",
            "config": {
              "name": "multiply_beta_403",
              "trainable": true,
              "dtype": "float32",
              "beta": 0.2
            },
            "name": "multiply_beta_403",
            "inbound_nodes": [
              [
                [
                  "LFF_1_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "LRL_1_3",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "LRL_1_3",
            "inbound_nodes": [
              [
                [
                  "LRL_1_2",
                  0,
                  0,
                  {}
                ],
                [
                  "multiply_beta_403",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "MultiplyBeta",
            "config": {
              "name": "multiply_beta_404",
              "trainable": true,
              "dtype": "float32",
              "beta": 0.2
            },
            "name": "multiply_beta_404",
            "inbound_nodes": [
              [
                [
                  "LRL_1_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "RRDB_1_out",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "RRDB_1_out",
            "inbound_nodes": [
              [
                [
                  "Pre_blocks_conv",
                  0,
                  0,
                  {}
                ],
                [
                  "multiply_beta_404",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_2_1_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_2_1_1",
            "inbound_nodes": [
              [
                [
                  "RRDB_1_out",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_2_1_1_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_2_1_1_Relu",
            "inbound_nodes": [
              [
                [
                  "F_2_1_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_2_1_1",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_2_1_1",
            "inbound_nodes": [
              [
                [
                  "RRDB_1_out",
                  0,
                  0,
                  {}
                ],
                [
                  "F_2_1_1_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_2_1_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_2_1_2",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_2_1_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_2_1_2_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_2_1_2_Relu",
            "inbound_nodes": [
              [
                [
                  "F_2_1_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_2_1_2",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_2_1_2",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_2_1_1",
                  0,
                  0,
                  {}
                ],
                [
                  "F_2_1_2_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_2_1_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "groups": 1,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": {
                  "minval": -0.05,
                  "maxval": 0.05,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_2_1_3",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_2_1_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_2_1_3_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_2_1_3_Relu",
            "inbound_nodes": [
              [
                [
                  "F_2_1_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_2_1_3",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_2_1_3",
            "inbound_nodes": [
              [
                [
                  "RDB_Concat_2_1_2",
                  0,
                  0,
                  {}
                ],
                [
                  "F_2_1_3_Relu",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_2_1_4",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
