{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of7.bin", "group1-shard2of7.bin", "group1-shard3of7.bin", "group1-shard4of7.bin", "group1-shard5of7.bin", "group1-shard6of7.bin", "group1-shard7of7.bin"], "weights": [{"name": "Pre_blocks_conv/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "Pre_blocks_conv/bias", "shape": [64], "dtype": "float32"}, {"name": "F_1_1_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_1_1_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_1_1_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_1_1_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_1_1_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_1_1_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_1_1_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_1_1_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_1_1/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_1_1/bias", "shape": [64], "dtype": "float32"}, {"name": "F_1_2_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_1_2_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_1_2_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_1_2_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_1_2_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_1_2_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_1_2_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_1_2_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_1_2/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_1_2/bias", "shape": [64], "dtype": "float32"}, {"name": "F_1_3_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_1_3_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_1_3_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_1_3_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_1_3_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_1_3_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_1_3_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_1_3_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_1_3/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_1_3/bias", "shape": [64], "dtype": "float32"}, {"name": "F_2_1_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_2_1_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_2_1_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_2_1_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_2_1_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_2_1_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_2_1_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_2_1_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_2_1/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_2_1/bias", "shape": [64], "dtype": "float32"}, {"name": "F_2_2_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_2_2_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_2_2_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_2_2_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_2_2_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_2_2_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_2_2_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_2_2_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_2_2/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_2_2/bias", "shape": [64], "dtype": "float32"}, {"name": "F_2_3_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_2_3_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_2_3_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_2_3_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_2_3_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_2_3_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_2_3_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_2_3_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_2_3/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_2_3/bias", "shape": [64], "dtype": "float32"}, {"name": "F_3_1_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_3_1_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_3_1_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_3_1_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_3_1_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_3_1_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_3_1_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_3_1_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_3_1/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_3_1/bias", "shape": [64], "dtype": "float32"}, {"name": "F_3_2_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_3_2_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_3_2_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_3_2_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_3_2_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_3_2_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_3_2_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_3_2_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_3_2/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_3_2/bias", "shape": [64], "dtype": "float32"}, {"name": "F_3_3_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_3_3_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_3_3_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_3_3_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_3_3_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_3_3_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_3_3_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_3_3_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_3_3/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_3_3/bias", "shape": [64], "dtype": "float32"}, {"name": "F_4_1_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_4_1_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_4_1_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_4_1_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_4_1_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_4_1_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_4_1_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_4_1_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_4_1/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_4_1/bias", "shape": [64], "dtype": "float32"}, {"name": "F_4_2_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_4_2_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_4_2_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_4_2_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_4_2_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_4_2_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_4_2_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_4_2_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_4_2/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_4_2/bias", "shape": [64], "dtype": "float32"}, {"name": "F_4_3_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_4_3_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_4_3_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_4_3_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_4_3_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_4_3_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_4_3_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_4_3_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_4_3/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_4_3/bias", "shape": [64], "dtype": "float32"}, {"name": "F_5_1_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_5_1_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_5_1_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_5_1_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_5_1_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_5_1_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_5_1_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_5_1_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_5_1/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_5_1/bias", "shape": [64], "dtype": "float32"}, {"name": "F_5_2_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_5_2_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_5_2_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_5_2_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_5_2_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_5_2_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_5_2_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_5_2_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_5_2/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_5_2/bias", "shape": [64], "dtype": "float32"}, {"name": "F_5_3_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_5_3_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_5_3_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_5_3_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_5_3_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_5_3_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_5_3_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_5_3_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_5_3/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_5_3/bias", "shape": [64], "dtype": "float32"}, {"name": "F_6_1_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_6_1_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_6_1_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_6_1_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_6_1_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_6_1_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_6_1_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_6_1_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_6_1/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_6_1/bias", "shape": [64], "dtype": "float32"}, {"name": "F_6_2_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_6_2_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_6_2_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_6_2_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_6_2_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_6_2_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_6_2_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_6_2_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_6_2/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_6_2/bias", "shape": [64], "dtype": "float32"}, {"name": "F_6_3_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_6_3_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_6_3_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_6_3_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_6_3_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_6_3_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_6_3_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_6_3_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_6_3/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_6_3/bias", "shape": [64], "dtype": "float32"}, {"name": "F_7_1_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_7_1_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_7_1_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_7_1_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_7_1_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_7_1_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_7_1_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_7_1_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_7_1/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_7_1/bias", "shape": [64], "dtype": "float32"}, {"name": "F_7_2_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_7_2_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_7_2_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_7_2_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_7_2_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_7_2_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_7_2_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_7_2_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_7_2/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_7_2/bias", "shape": [64], "dtype": "float32"}, {"name": "F_7_3_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_7_3_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_7_3_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_7_3_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_7_3_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_7_3_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_7_3_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_7_3_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_7_3/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_7_3/bias", "shape": [64], "dtype": "float32"}, {"name": "F_8_1_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_8_1_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_8_1_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_8_1_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_8_1_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_8_1_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_8_1_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_8_1_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_8_1/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_8_1/bias", "shape": [64], "dtype": "float32"}, {"name": "F_8_2_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_8_2_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_8_2_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_8_2_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_8_2_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_8_2_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_8_2_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_8_2_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_8_2/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_8_2/bias", "shape": [64], "dtype": "float32"}, {"name": "F_8_3_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_8_3_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_8_3_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_8_3_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_8_3_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_8_3_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_8_3_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_8_3_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_8_3/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_8_3/bias", "shape": [64], "dtype": "float32"}, {"name": "F_9_1_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_9_1_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_9_1_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_9_1_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_9_1_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_9_1_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_9_1_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_9_1_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_9_1/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_9_1/bias", "shape": [64], "dtype": "float32"}, {"name": "F_9_2_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_9_2_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_9_2_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_9_2_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_9_2_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_9_2_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_9_2_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_9_2_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_9_2/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_9_2/bias", "shape": [64], "dtype": "float32"}, {"name": "F_9_3_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_9_3_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_9_3_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_9_3_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_9_3_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_9_3_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_9_3_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_9_3_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_9_3/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_9_3/bias", "shape": [64], "dtype": "float32"}, {"name": "F_10_1_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_10_1_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_10_1_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_10_1_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_10_1_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_10_1_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_10_1_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_10_1_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_10_1/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_10_1/bias", "shape": [64], "dtype": "float32"}, {"name": "F_10_2_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_10_2_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_10_2_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_10_2_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_10_2_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_10_2_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_10_2_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_10_2_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_10_2/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_10_2/bias", "shape": [64], "dtype": "float32"}, {"name": "F_10_3_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "F_10_3_1/bias", "shape": [32], "dtype": "float32"}, {"name": "F_10_3_2/kernel", "shape": [3, 3, 96, 32], "dtype": "float32"}, {"name": "F_10_3_2/bias", "shape": [32], "dtype": "float32"}, {"name": "F_10_3_3/kernel", "shape": [3, 3, 128, 32], "dtype": "float32"}, {"name": "F_10_3_3/bias", "shape": [32], "dtype": "float32"}, {"name": "F_10_3_4/kernel", "shape": [3, 3, 160, 32], "dtype": "float32"}, {"name": "F_10_3_4/bias", "shape": [32], "dtype": "float32"}, {"name": "LFF_10_3/kernel", "shape": [3, 3, 192, 64], "dtype": "float32"}, {"name": "LFF_10_3/bias", "shape": [64], "dtype": "float32"}, {"name": "post_blocks_conv/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "post_blocks_conv/bias", "shape": [64], "dtype": "float32"}, {"name": "PreShuffle/kernel", "shape": [3, 3, 64, 27], "dtype": "float32"}, {"name": "PreShuffle/bias", "shape": [27], "dtype": "float32"}, {"name": "SR/kernel", "shape": [3, 3, 3, 3], "dtype": "float32"}, {"name": "SR/bias", "shape": [3], "dtype": "float32"}]}]}