{
  "format": "layers-model",
  "generatedBy": "keras v2.3.0-tf",
  "convertedBy": "TensorFlow.js Converter v2.0.1.post1",
  "modelTopology": {
    "keras_version": "2.3.0-tf",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "generator",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, null, null, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "LR"
            },
            "name": "LR",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_m1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_m1",
            "inbound_nodes": [[["LR", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_0",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_0",
            "inbound_nodes": [[["F_m1", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_1",
            "inbound_nodes": [[["F_0", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_1_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_1_Relu",
            "inbound_nodes": [[["F_1_1", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_1",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_1",
            "inbound_nodes": [
              [
                ["F_0", 0, 0, {}],
                ["F_1_1_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_2",
            "inbound_nodes": [[["RDB_Concat_1_1", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_2_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_2_Relu",
            "inbound_nodes": [[["F_1_2", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_2",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_2",
            "inbound_nodes": [
              [
                ["RDB_Concat_1_1", 0, 0, {}],
                ["F_1_2_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_1_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_1_3",
            "inbound_nodes": [[["RDB_Concat_1_2", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_1_3_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_1_3_Relu",
            "inbound_nodes": [[["F_1_3", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_1_3",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_1_3",
            "inbound_nodes": [
              [
                ["RDB_Concat_1_2", 0, 0, {}],
                ["F_1_3_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "LFF_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "LFF_1",
            "inbound_nodes": [[["RDB_Concat_1_3", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "LRL_1",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "LRL_1",
            "inbound_nodes": [
              [
                ["LFF_1", 0, 0, {}],
                ["F_0", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_2_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_2_1",
            "inbound_nodes": [[["LRL_1", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_2_1_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_2_1_Relu",
            "inbound_nodes": [[["F_2_1", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_2_1",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_2_1",
            "inbound_nodes": [
              [
                ["LRL_1", 0, 0, {}],
                ["F_2_1_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_2_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_2_2",
            "inbound_nodes": [[["RDB_Concat_2_1", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_2_2_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_2_2_Relu",
            "inbound_nodes": [[["F_2_2", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_2_2",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_2_2",
            "inbound_nodes": [
              [
                ["RDB_Concat_2_1", 0, 0, {}],
                ["F_2_2_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_2_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_2_3",
            "inbound_nodes": [[["RDB_Concat_2_2", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_2_3_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_2_3_Relu",
            "inbound_nodes": [[["F_2_3", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_2_3",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_2_3",
            "inbound_nodes": [
              [
                ["RDB_Concat_2_2", 0, 0, {}],
                ["F_2_3_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "LFF_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "LFF_2",
            "inbound_nodes": [[["RDB_Concat_2_3", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "LRL_2",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "LRL_2",
            "inbound_nodes": [
              [
                ["LFF_2", 0, 0, {}],
                ["LRL_1", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_3_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_3_1",
            "inbound_nodes": [[["LRL_2", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_3_1_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_3_1_Relu",
            "inbound_nodes": [[["F_3_1", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_3_1",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_3_1",
            "inbound_nodes": [
              [
                ["LRL_2", 0, 0, {}],
                ["F_3_1_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_3_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_3_2",
            "inbound_nodes": [[["RDB_Concat_3_1", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_3_2_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_3_2_Relu",
            "inbound_nodes": [[["F_3_2", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_3_2",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_3_2",
            "inbound_nodes": [
              [
                ["RDB_Concat_3_1", 0, 0, {}],
                ["F_3_2_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_3_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_3_3",
            "inbound_nodes": [[["RDB_Concat_3_2", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_3_3_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_3_3_Relu",
            "inbound_nodes": [[["F_3_3", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_3_3",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_3_3",
            "inbound_nodes": [
              [
                ["RDB_Concat_3_2", 0, 0, {}],
                ["F_3_3_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "LFF_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "LFF_3",
            "inbound_nodes": [[["RDB_Concat_3_3", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "LRL_3",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "LRL_3",
            "inbound_nodes": [
              [
                ["LFF_3", 0, 0, {}],
                ["LRL_2", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_4_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_4_1",
            "inbound_nodes": [[["LRL_3", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_4_1_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_4_1_Relu",
            "inbound_nodes": [[["F_4_1", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_4_1",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_4_1",
            "inbound_nodes": [
              [
                ["LRL_3", 0, 0, {}],
                ["F_4_1_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_4_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_4_2",
            "inbound_nodes": [[["RDB_Concat_4_1", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_4_2_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_4_2_Relu",
            "inbound_nodes": [[["F_4_2", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_4_2",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_4_2",
            "inbound_nodes": [
              [
                ["RDB_Concat_4_1", 0, 0, {}],
                ["F_4_2_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_4_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_4_3",
            "inbound_nodes": [[["RDB_Concat_4_2", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_4_3_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_4_3_Relu",
            "inbound_nodes": [[["F_4_3", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_4_3",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_4_3",
            "inbound_nodes": [
              [
                ["RDB_Concat_4_2", 0, 0, {}],
                ["F_4_3_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "LFF_4",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "LFF_4",
            "inbound_nodes": [[["RDB_Concat_4_3", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "LRL_4",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "LRL_4",
            "inbound_nodes": [
              [
                ["LFF_4", 0, 0, {}],
                ["LRL_3", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_5_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_5_1",
            "inbound_nodes": [[["LRL_4", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_5_1_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_5_1_Relu",
            "inbound_nodes": [[["F_5_1", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_5_1",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_5_1",
            "inbound_nodes": [
              [
                ["LRL_4", 0, 0, {}],
                ["F_5_1_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_5_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_5_2",
            "inbound_nodes": [[["RDB_Concat_5_1", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_5_2_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_5_2_Relu",
            "inbound_nodes": [[["F_5_2", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_5_2",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_5_2",
            "inbound_nodes": [
              [
                ["RDB_Concat_5_1", 0, 0, {}],
                ["F_5_2_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_5_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_5_3",
            "inbound_nodes": [[["RDB_Concat_5_2", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_5_3_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_5_3_Relu",
            "inbound_nodes": [[["F_5_3", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_5_3",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_5_3",
            "inbound_nodes": [
              [
                ["RDB_Concat_5_2", 0, 0, {}],
                ["F_5_3_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "LFF_5",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "LFF_5",
            "inbound_nodes": [[["RDB_Concat_5_3", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "LRL_5",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "LRL_5",
            "inbound_nodes": [
              [
                ["LFF_5", 0, 0, {}],
                ["LRL_4", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_6_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_6_1",
            "inbound_nodes": [[["LRL_5", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_6_1_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_6_1_Relu",
            "inbound_nodes": [[["F_6_1", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_6_1",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_6_1",
            "inbound_nodes": [
              [
                ["LRL_5", 0, 0, {}],
                ["F_6_1_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_6_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_6_2",
            "inbound_nodes": [[["RDB_Concat_6_1", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_6_2_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_6_2_Relu",
            "inbound_nodes": [[["F_6_2", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_6_2",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_6_2",
            "inbound_nodes": [
              [
                ["RDB_Concat_6_1", 0, 0, {}],
                ["F_6_2_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_6_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_6_3",
            "inbound_nodes": [[["RDB_Concat_6_2", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_6_3_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_6_3_Relu",
            "inbound_nodes": [[["F_6_3", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_6_3",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_6_3",
            "inbound_nodes": [
              [
                ["RDB_Concat_6_2", 0, 0, {}],
                ["F_6_3_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "LFF_6",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "LFF_6",
            "inbound_nodes": [[["RDB_Concat_6_3", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "LRL_6",
              "trainable": true,
              "dtype": "float32"
            },
            "name": "LRL_6",
            "inbound_nodes": [
              [
                ["LFF_6", 0, 0, {}],
                ["LRL_5", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_7_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_7_1",
            "inbound_nodes": [[["LRL_6", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_7_1_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_7_1_Relu",
            "inbound_nodes": [[["F_7_1", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_7_1",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_7_1",
            "inbound_nodes": [
              [
                ["LRL_6", 0, 0, {}],
                ["F_7_1_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_7_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_7_2",
            "inbound_nodes": [[["RDB_Concat_7_1", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_7_2_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_7_2_Relu",
            "inbound_nodes": [[["F_7_2", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_7_2",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_7_2",
            "inbound_nodes": [
              [
                ["RDB_Concat_7_1", 0, 0, {}],
                ["F_7_2_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "F_7_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "F_7_3",
            "inbound_nodes": [[["RDB_Concat_7_2", 0, 0, {}]]]
          },
          {
            "class_name": "Activation",
            "config": {
              "name": "F_7_3_Relu",
              "trainable": true,
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "F_7_3_Relu",
            "inbound_nodes": [[["F_7_3", 0, 0, {}]]]
          },
          {
            "class_name": "Concatenate",
            "config": {
              "name": "RDB_Concat_7_3",
              "trainable": true,
              "dtype": "float32",
              "axis": 3
            },
            "name": "RDB_Concat_7_3",
            "inbound_nodes": [
              [
                ["RDB_Concat_7_2", 0, 0, {}],
                ["F_7_3_Relu", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "LFF_7",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "LFF_7",
            "inbound_nodes": [[["RDB_Concat_7_3", 0, 0, {}]]]
          },
          {
            "class_name": "Add",
            "config": {
              "name": "LRL_7",
