{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","name":"up_sampling2d_UpSampling2D1","trainable":true,"batch_input_shape":[null,null,null,3],"dtype":"float32"}}]},"keras_version":"tfjs-layers 3.13.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.13.0","convertedBy":null,"weightsManifest":[{"paths":["./2x.bin"],"weights":[]}]}
